<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 8 changes.</summary>

```diff
~ module.coreos-module-vm.data.ct_config.fedora-coreos-config will be read during apply
# (config refers to values not yet known)
! module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
! module.coreos-module-vm.random_pet.random_hostname must be replaced
~ module.coreos-module-vm2.data.ct_config.fedora-coreos-config will be read during apply
# (config refers to values not yet known)
! module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm must be replaced
! module.coreos-module-vm2.random_pet.random_hostname must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 6 to add, 0 to change, 6 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-12T07:16:43Z [(view log)](https://github.com/perchnet/p/actions/runs/16235646342/job/45845377965#step:9:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.coreos-module-vm.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = [
          + <<-EOT
                variant: fcos
                version: 1.4.0
                storage:
                  directories:
                    - path: /etc/ucore-autorebase
                      mode: 0754
                systemd:
                  units:
                    - name: ucore-unsigned-autorebase.service
                      enabled: true
                      contents: |
                        [Unit]
                        Description=uCore autorebase to unsigned OCI and reboot
                        ConditionPathExists=!/etc/ucore-autorebase/unverified
                        ConditionPathExists=!/etc/ucore-autorebase/signed
                        After=network-online.target
                        Wants=network-online.target
                        [Service]
                        Type=oneshot
                        StandardOutput=journal+console
                        ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-unverified-registry:ghcr.io/ublue-os/ucore-hci:stable
                        ExecStart=/usr/bin/touch /etc/ucore-autorebase/unverified
                        ExecStart=/usr/bin/systemctl disable ucore-unsigned-autorebase.service
                        ExecStart=/usr/bin/systemctl reboot
                        [Install]
                        WantedBy=multi-user.target
                    - name: ucore-signed-autorebase.service
                      enabled: true
                      contents: |
                        [Unit]
                        Description=uCore autorebase to signed OCI and reboot
                        ConditionPathExists=/etc/ucore-autorebase/unverified
                        ConditionPathExists=!/etc/ucore-autorebase/signed
                        After=network-online.target
                        Wants=network-online.target
                        [Service]
                        Type=oneshot
                        StandardOutput=journal+console
                        ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-image-signed:docker://ghcr.io/ublue-os/ucore-hci:stable
                        ExecStart=/usr/bin/touch /etc/ucore-autorebase/signed
                        ExecStart=/usr/bin/systemctl disable ucore-signed-autorebase.service
                        ExecStart=/usr/bin/systemctl reboot
                        [Install]
                        WantedBy=multi-user.target
            EOT,
        ]
      + strict       = true
    }

  # module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "d8dc03c8.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/d8dc03c8.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = jsonencode(
                {
                  - ignition        = {
                      - config   = {
                          - replace = {
                              - verification = {}
                            }
                        }
                      - proxy    = {}
                      - security = {
                          - tls = {}
                        }
                      - timeouts = {}
                      - version  = "3.4.0"
                    }
                  - kernelArguments = {}
                  - passwd          = {
                      - users = [
                          - {
                              - name              = "core"
                              - passwordHash      = "$2a$10$ergdn9K7zm8drq/hpVdZ6eSo5T4N39rGmug3w10A7M668N3hLMMfS"
                              - sshAuthorizedKeys = [
                                  - "ssh-key ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                                ]
                            },
                        ]
                    }
                  - storage         = {
                      - directories = [
                          - {
                              - group = {}
                              - mode  = 492
                              - path  = "/etc/ucore-autorebase"
                              - user  = {}
                            },
                        ]
                      - files       = [
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,Hello%20World!%0A"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/motd"
                              - user      = {}
                            },
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,safe-mastiff"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/hostname"
                              - user      = {}
                            },
                        ]
                    }
                  - systemd         = {
                      - units = [
                          - {
                              - contents = <<-EOT
                                    [Unit]
                                    Description=uCore autorebase to unsigned OCI and reboot
                                    ConditionPathExists=!/etc/ucore-autorebase/unverified
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    StandardOutput=journal+console
                                    ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-unverified-registry:ghcr.io/ublue-os/ucore-hci:stable
                                    ExecStart=/usr/bin/touch /etc/ucore-autorebase/unverified
                                    ExecStart=/usr/bin/systemctl disable ucore-unsigned-autorebase.service
                                    ExecStart=/usr/bin/systemctl reboot
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              - enabled  = true
                              - name     = "ucore-unsigned-autorebase.service"
                            },
                          - {
                              - contents = <<-EOT
                                    [Unit]
                                    Description=uCore autorebase to signed OCI and reboot
                                    ConditionPathExists=/etc/ucore-autorebase/unverified
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    StandardOutput=journal+console
                                    ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-image-signed:docker://ghcr.io/ublue-os/ucore-hci:stable
                                    ExecStart=/usr/bin/touch /etc/ucore-autorebase/signed
                                    ExecStart=/usr/bin/systemctl disable ucore-signed-autorebase.service
                                    ExecStart=/usr/bin/systemctl reboot
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              - enabled  = true
                              - name     = "ucore-signed-autorebase.service"
                            },
                        ]
                    }
                }
            ) -> (known after apply) # forces replacement
          ~ file_name = "d8dc03c8.butane-ci-user-data.ign" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:D3:CD:FA",
        ] -> (known after apply)
      ~ name                    = "safe-mastiff" -> (known after apply)
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ agent {
          ~ enabled = false -> true
            # (3 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/d8dc03c8.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:D3:CD:FA" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.coreos-module-vm.random_pet.random_hostname must be replaced
-/+ resource "random_pet" "random_hostname" {
      ~ id        = "safe-mastiff" -> (known after apply)
      ~ keepers   = { # forces replacement
          ~ "flat_hash" = (sensitive value)
        }
        # (2 unchanged attributes hidden)
    }

  # module.coreos-module-vm2.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = [
          + <<-EOT
                variant: fcos
                version: 1.4.0
                storage:
                  directories:
                    - path: /etc/ucore-autorebase
                      mode: 0754
                systemd:
                  units:
                    - name: ucore-unsigned-autorebase.service
                      enabled: true
                      contents: |
                        [Unit]
                        Description=uCore autorebase to unsigned OCI and reboot
                        ConditionPathExists=!/etc/ucore-autorebase/unverified
                        ConditionPathExists=!/etc/ucore-autorebase/signed
                        After=network-online.target
                        Wants=network-online.target
                        [Service]
                        Type=oneshot
                        StandardOutput=journal+console
                        ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-unverified-registry:ghcr.io/ublue-os/ucore-hci:stable
                        ExecStart=/usr/bin/touch /etc/ucore-autorebase/unverified
                        ExecStart=/usr/bin/systemctl disable ucore-unsigned-autorebase.service
                        ExecStart=/usr/bin/systemctl reboot
                        [Install]
                        WantedBy=multi-user.target
                    - name: ucore-signed-autorebase.service
                      enabled: true
                      contents: |
                        [Unit]
                        Description=uCore autorebase to signed OCI and reboot
                        ConditionPathExists=/etc/ucore-autorebase/unverified
                        ConditionPathExists=!/etc/ucore-autorebase/signed
                        After=network-online.target
                        Wants=network-online.target
                        [Service]
                        Type=oneshot
                        StandardOutput=journal+console
                        ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-image-signed:docker://ghcr.io/ublue-os/ucore-hci:stable
                        ExecStart=/usr/bin/touch /etc/ucore-autorebase/signed
                        ExecStart=/usr/bin/systemctl disable ucore-signed-autorebase.service
                        ExecStart=/usr/bin/systemctl reboot
                        [Install]
                        WantedBy=multi-user.target
            EOT,
          + <<-EOT
                variant: fcos
                version: 1.5.0
                systemd:
                  units:
                    - name: setup-periphery.service
                      enabled: true
                      contents: |
                        [Unit]
                        Description=Download and set up Komodo Periphery
                        After=network-online.target
                        Wants=network-online.target
                        ConditionPathExists=!/etc/ucore-autorebase/signed
                        [Service]
                        Type=oneshot
                        #StandardOutput=journal+console
                        ExecStart=/usr/bin/curl -sSL https://raw.githubusercontent.com/moghtech/komodo/main/scripts/setup-periphery.py | python3
                        [Install]
                        WantedBy=multi-user.target
            EOT,
        ]
      + strict       = true
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "b6a8e705.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/b6a8e705.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = jsonencode(
                {
                  - ignition        = {
                      - config   = {
                          - replace = {
                              - verification = {}
                            }
                        }
                      - proxy    = {}
                      - security = {
                          - tls = {}
                        }
                      - timeouts = {}
                      - version  = "3.4.0"
                    }
                  - kernelArguments = {}
                  - passwd          = {
                      - users = [
                          - {
                              - name              = "core"
                              - passwordHash      = "$2a$10$1YSYxLy/9lonDgbkYgiUpOtJJrfJOUi2tuPNR7JoLt.0FA1siUYRy"
                              - sshAuthorizedKeys = [
                                  - "ssh-key ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                                ]
                            },
                        ]
                    }
                  - storage         = {
                      - directories = [
                          - {
                              - group = {}
                              - mode  = 492
                              - path  = "/etc/ucore-autorebase"
                              - user  = {}
                            },
                        ]
                      - files       = [
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,Hello%20World!%0A"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/motd"
                              - user      = {}
                            },
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,capable-dinosaur"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/hostname"
                              - user      = {}
                            },
                        ]
                    }
                  - systemd         = {
                      - units = [
                          - {
                              - contents = <<-EOT
                                    [Unit]
                                    Description=uCore autorebase to unsigned OCI and reboot
                                    ConditionPathExists=!/etc/ucore-autorebase/unverified
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    StandardOutput=journal+console
                                    ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-unverified-registry:ghcr.io/ublue-os/ucore-hci:stable
                                    ExecStart=/usr/bin/touch /etc/ucore-autorebase/unverified
                                    ExecStart=/usr/bin/systemctl disable ucore-unsigned-autorebase.service
                                    ExecStart=/usr/bin/systemctl reboot
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              - enabled  = true
                              - name     = "ucore-unsigned-autorebase.service"
                            },
                          - {
                              - contents = <<-EOT
                                    [Unit]
                                    Description=uCore autorebase to signed OCI and reboot
                                    ConditionPathExists=/etc/ucore-autorebase/unverified
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    StandardOutput=journal+console
                                    ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-image-signed:docker://ghcr.io/ublue-os/ucore-hci:stable
                                    ExecStart=/usr/bin/touch /etc/ucore-autorebase/signed
                                    ExecStart=/usr/bin/systemctl disable ucore-signed-autorebase.service
                                    ExecStart=/usr/bin/systemctl reboot
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              - enabled  = true
                              - name     = "ucore-signed-autorebase.service"
                            },
                          - {
                              - contents = <<-EOT
                                    [Unit]
                                    Description=Download and set up Komodo Periphery
                                    After=network-online.target
                                    Wants=network-online.target
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    [Service]
                                    Type=oneshot
                                    #StandardOutput=journal+console
                                    ExecStart=/usr/bin/curl -sSL https://raw.githubusercontent.com/moghtech/komodo/main/scripts/setup-periphery.py | python3
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              - enabled  = true
                              - name     = "setup-periphery.service"
                            },
                        ]
                    }
                }
            ) -> (known after apply) # forces replacement
          ~ file_name = "b6a8e705.butane-ci-user-data.ign" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "132" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:D6:2B:86",
        ] -> (known after apply)
      ~ name                    = "capable-dinosaur" -> (known after apply)
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 132 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ agent {
          ~ enabled = false -> true
            # (3 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-132-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/b6a8e705.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:D6:2B:86" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.coreos-module-vm2.random_pet.random_hostname must be replaced
-/+ resource "random_pet" "random_hostname" {
      ~ id        = "capable-dinosaur" -> (known after apply)
      ~ keepers   = { # forces replacement
          ~ "flat_hash" = (sensitive value)
        }
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-29-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->